In [2]:
import numpy as np
import pandas as pd

In [16]:
data = [1,2,3,4,5]
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
type(s)

pandas.core.series.Series

In [28]:
pd.Series(['Sandy',25,True,'Plant',1.2])  #given string,int,boolean,float

0    Sandy
1       25
2     True
3    Plant
4      1.2
dtype: object

In [24]:
pd.Series(data,index=['a','b','c','d','e']) # changed the index name for the data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
data = {
    'Name':['Sandya','Toby','Jeevan','Karthik','Haanvika'],
    'Age':[25,28,27,28,20],
    'BG':['B+','AB-','B-','AB','A-']
}

In [8]:
df = pd.DataFrame(data)
df

       Name  Age   BG
0    Sandya   25   B+
1      Toby   28  AB-
2    Jeevan   27   B-
3   Karthik   28   AB
4  Haanvika   20   A-

In [10]:
new_row = {'Name':'Mary',
    'Age':27,
    'BG':'A+'}
df.loc[len(df)] = new_row # Method1 to add new row
df
# Method 2 - df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

       Name  Age   BG
0    Sandya   25   B+
1      Toby   28  AB-
2    Jeevan   27   B-
3   Karthik   28   AB
4  Haanvika   20   A-
5      Mary   27   A+

In [14]:
df['Phone Number'] = [913445,824435,934848,973849,612347,235647]
df

       Name  Age   BG  Phone Number
0    Sandya   25   B+        913445
1      Toby   28  AB-        824435
2    Jeevan   27   B-        934848
3   Karthik   28   AB        973849
4  Haanvika   20   A-        612347
5      Mary   27   A+        235647

In [114]:
#location
df[1:3]

     Name  Age   BG  Phone Number
1    Toby   28  AB-        824435
2  Jeevan   27   B-        934848

In [116]:
df[0:4]

      Name  Age   BG  Phone Number
0   Sandya   25   B+        913445
1     Toby   28  AB-        824435
2   Jeevan   27   B-        934848
3  Karthik   28   AB        973849

In [118]:
df.loc[4,['Name','Age']]

Name    Haanvika
Age           20
Name: 4, dtype: object

In [124]:
df.loc[2,['Name','BG']]

Name    Jeevan
BG          B-
Name: 2, dtype: object

In [130]:
df['Age'] == 25

0     True
1    False
2    False
3    False
4    False
Name: Age, dtype: bool

In [132]:
df['Age'] == 28

0    False
1     True
2    False
3     True
4    False
Name: Age, dtype: bool

In [134]:
#iloc

df.iloc[3]

Name            Karthik
Age                  28
BG                   AB
Phone Number     973849
Name: 3, dtype: object

In [136]:
df.iloc[4]

Name            Haanvika
Age                   20
BG                    A-
Phone Number      612347
Name: 4, dtype: object

In [138]:
df.iloc[1:4]

      Name  Age   BG  Phone Number
1     Toby   28  AB-        824435
2   Jeevan   27   B-        934848
3  Karthik   28   AB        973849

In [142]:
df.iloc[[0,1,4]]

       Name  Age   BG  Phone Number
0    Sandya   25   B+        913445
1      Toby   28  AB-        824435
4  Haanvika   20   A-        612347

In [144]:
df.iloc[1,[0,2]]

Name    Toby
BG       AB-
Name: 1, dtype: object

In [22]:
Grocery = pd.DataFrame({
    'Pid': [101,102,103,104,105],
    'PName': ['Soap', 'Shampoo','Rice','Sugar','Salt'],
    'Price': [100,258,1500,50,30]
})

In [24]:
Grocery

   Pid    PName  Price
0  101     Soap    100
1  102  Shampoo    258
2  103     Rice   1500
3  104    Sugar     50
4  105     Salt     30

In [26]:
Sales_Data = pd.DataFrame({
    'Pid': [101,102,103,104,105],
    'Sales':[40, 50, 10, 12, 10]
})

In [28]:
Sales_Data

   Pid  Sales
0  101     40
1  102     50
2  103     10
3  104     12
4  105     10

In [30]:
review_data = pd.DataFrame({
    "Pid":[101,102,103,104,105],
    "review":[5, 4, 4, 5, 3]
})

In [32]:
review_data

   Pid  review
0  101       5
1  102       4
2  103       4
3  104       5
4  105       3

In [34]:
Merge_data  = pd.merge(Grocery, Sales_Data, on = 'Pid') #merge
Merge_data

   Pid    PName  Price  Sales
0  101     Soap    100     40
1  102  Shampoo    258     50
2  103     Rice   1500     10
3  104    Sugar     50     12
4  105     Salt     30     10

In [42]:
Merge_data['Revenue'] = Merge_data['Price'] * Merge_data['Sales']
Merge_data

   Pid    PName  Price  Sales  Revenue
0  101     Soap    100     40     4000
1  102  Shampoo    258     50    12900
2  103     Rice   1500     10    15000
3  104    Sugar     50     12      600
4  105     Salt     30     10      300

In [50]:
Merge_data['Revenue'].sum()

32800

In [58]:
print('Grocery:', Grocery)
print('Sales Data:', Sales_Data)
print('Review Data:',review_data)

Grocery:    Pid    PName  Price
0  101     Soap    100
1  102  Shampoo    258
2  103     Rice   1500
3  104    Sugar     50
4  105     Salt     30
Sales Data:    Pid  Sales
0  101     40
1  102     50
2  103     10
3  104     12
4  105     10
Review Data:    Pid  review
0  101       5
1  102       4
2  103       4
3  104       5
4  105       3

In [62]:
#JOIN
join_data = Grocery.set_index('Pid').join(review_data.set_index('Pid'))
join_data

       PName  Price  review
Pid
101     Soap    100       5
102  Shampoo    258       4
103     Rice   1500       4
104    Sugar     50       5
105     Salt     30       3